// TRR0099.AD.A -- Query 1: Join across tables
// DDM Operation: n4 "Authenticate"

let lookback = 24h;
let tgt_issuances =
    SecurityEvent
    | where TimeGenerated > ago(lookback)
    | where EventID == 4768
    | where Status == "0x0"
    | distinct TargetUserName;
SecurityEvent
| where TimeGenerated > ago(lookback)
| where EventID == 4769
| where Status == "0x0"
| join kind=leftanti tgt_issuances on TargetUserName
| extend IsMachineAccount = TargetUserName endswith "$"
| project
    TimeGenerated,
    Computer,
    TargetUserName,
    TargetDomainName,
    ServiceName,
    TicketOptions,
    TicketEncryptionType,
    IpAddress,
    IpPort,
    IsMachineAccount
| sort by TimeGenerated desc
;
